In [3]:
import pandas as pd

# Load the dataset
titanic = pd.read_csv("titanic.csv")

# Display first few rows
titanic.head()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [4]:
# Dataset shape
titanic.shape

(1309, 28)

In [5]:
# Column info
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 28 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Passengerid  1309 non-null   int64
 1   Age          1309 non-null   float64
 2   Fare         1309 non-null   float64
 3   Sex          1309 non-null   int64
 4   sibsp        1309 non-null   int64
 5   zero         1309 non-null   int64
 6   zero.1       1309 non-null   int64
 7   zero.2       1309 non-null   int64
 8   zero.3       1309 non-null   int64
 9   zero.4       1309 non-null   int64
 10  zero.5       1309 non-null   int64
 11  zero.6       1309 non-null   int64
 12  Parch        1309 non-null   int64
 13  zero.7       1309 non-null   int64
 14  zero.8       1309 non-null   int64
 15  zero.9       1309 non-null   int64
 16  zero.10      1309 non-null   int64
 17  zero.11      1309 non-null   int64
 18  zero.12      1309 non-null   int64
 19  zero.13      1309 non-null   int64
 20  zero.14      1309 non-null   int64
 21  Pclass       1309 non-null   int64
 22  zero.15      1309 non-null   int64
 23  zero.16      1309 non-null   int64
 24  Embarked     1307 non-null   float64
 25  zero.17      1309 non-null   int64
 26  zero.18      1309 non-null   int64
 27  2urvived     1309 non-null   int64
dtypes: float64(3), int64(25)
memory usage: 286.5 KB

In [6]:
# Statistical summary
titanic.describe()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.0,1309.0,1309.0,1309.0,1309.0,...,1309.0,1309.0,1309.0,1309.000000,1309.0,1309.0,1307.000000,1309.0,1309.0,1309.000000
mean,655.000000,29.503186,33.281086,0.355997,0.498854,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.294882,0.0,0.0,1.492731,0.0,0.0,0.261268
std,378.020061,12.905241,51.741500,0.478997,1.041658,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.837836,0.0,0.0,0.814626,0.0,0.0,0.439494
min,1.000000,0.170000,0.000000,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,1.000000,0.0,0.0,0.000000,0.0,0.0,0.000000
25%,328.000000,22.000000,7.895800,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.000000,0.0,0.0,1.000000,0.0,0.0,0.000000
50%,655.000000,28.000000,14.454200,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,0.000000
75%,982.000000,35.000000,31.275000,1.000000,1.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,1.000000
max,1309.000000,80.000000,512.329200,1.000000,8.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,1.000000

In [8]:
titanic.columns

Index(['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp', 'zero', 'zero.1',
       'zero.2', 'zero.3', 'zero.4', 'zero.5', 'zero.6', 'Parch', 'zero.7',
       'zero.8', 'zero.9', 'zero.10', 'zero.11', 'zero.12', 'zero.13',
       'zero.14', 'Pclass', 'zero.15', 'zero.16', 'Embarked', 'zero.17',
       'zero.18', '2urvived'],
      dtype='object')

In [11]:
cols = ["Age", "Fare", "Sex", "sibsp", "Parch", "Pclass", "Embarked", "2urvived"]
titanic_clean = titanic[cols]

titanic_clean.head()

    Age     Fare  Sex  sibsp  Parch  Pclass  Embarked  2urvived
0  22.0   7.2500    0      1      0       3       2.0         0
1  38.0  71.2833    1      1      0       1       0.0         1
2  26.0   7.9250    1      0      0       3       2.0         1
3  35.0  53.1000    1      1      0       1       2.0         1
4  35.0   8.0500    0      0      0       3       2.0         0

In [12]:
# Passengers who survived
survivors = titanic_clean[titanic_clean["2urvived"] == 1]
survivors.head()

    Age     Fare  Sex  sibsp  Parch  Pclass  Embarked  2urvived
1  38.0  71.2833    1      1      0       1       0.0         1
2  26.0   7.9250    1      0      0       3       2.0         1
3  35.0  53.1000    1      1      0       1       2.0         1
8  27.0  11.1333    1      0      2       3       2.0         1
9  14.0  30.0708    1      1      0       2       0.0         1

In [14]:
titanic = titanic.rename(columns={'2urvived': 'Survived'})

In [15]:
titanic.columns

Index(['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp', 'zero', 'zero.1',
       'zero.2', 'zero.3', 'zero.4', 'zero.5', 'zero.6', 'Parch', 'zero.7',
       'zero.8', 'zero.9', 'zero.10', 'zero.11', 'zero.12', 'zero.13',
       'zero.14', 'Pclass', 'zero.15', 'zero.16', 'Embarked', 'zero.17',
       'zero.18', 'Survived'],
      dtype='object')

In [16]:
cols = ["Age", "Fare", "Sex", "sibsp", "Parch", "Pclass", "Embarked", "Survived"]
titanic_clean = titanic[cols]

titanic_clean.head()

    Age     Fare  Sex  sibsp  Parch  Pclass  Embarked  Survived
0  22.0   7.2500    0      1      0       3       2.0         0
1  38.0  71.2833    1      1      0       1       0.0         1
2  26.0   7.9250    1      0      0       3       2.0         1
3  35.0  53.1000    1      1      0       1       2.0         1
4  35.0   8.0500    0      0      0       3       2.0         0

In [17]:
# Passengers who survived
survivors = titanic_clean[titanic_clean["Survived"] == 1]
survivors.head()

    Age     Fare  Sex  sibsp  Parch  Pclass  Embarked  Survived
1  38.0  71.2833    1      1      0       1       0.0         1
2  26.0   7.9250    1      0      0       3       2.0         1
3  35.0  53.1000    1      1      0       1       2.0         1
8  27.0  11.1333    1      0      2       3       2.0         1
9  14.0  30.0708    1      1      0       2       0.0         1

In [18]:
# Passengers in first class
first_class = titanic_clean[titanic_clean["Pclass"] == 1]
first_class.head()

     Age     Fare  Sex  sibsp  Parch  Pclass  Embarked  Survived
1   38.0  71.2833    1      1      0       1       0.0         1
3   35.0  53.1000    1      1      0       1       2.0         1
6   54.0  51.8625    0      0      0       1       2.0         0
11  58.0  26.5500    1      0      0       1       2.0         1
23  28.0  35.5000    0      0      0       1       2.0         1

In [19]:
# Survival count by class
titanic_clean.groupby("Pclass")["Survived"].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [20]:
# Average fare by class
titanic_clean.groupby("Pclass")["Fare"].mean()

Pclass
1    87.508992
2    21.179196
3    13.304513
Name: Fare, dtype: float64

In [21]:
def age_group(age):
    if pd.isna(age):
        return "Unknown"
    elif age < 18:
        return "Child"
    elif age < 60:
        return "Adult"
    else:
        return "Senior"

titanic_clean["AgeGroup"] = titanic_clean["Age"].apply(age_group)

titanic_clean[["Age", "AgeGroup"]].head()

/var/folders/84/673bjm_x7j1f85ng07w19pjr0000gn/T/ipykernel_20015/881904176.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic_clean["AgeGroup"] = titanic_clean["Age"].apply(age_group)

    Age AgeGroup
0  22.0    Adult
1  38.0    Adult
2  26.0    Adult
3  35.0    Adult
4  35.0    Adult

In [22]:
def fare_category(row):
    if row.Fare < 20:
        return "Low"
    elif row.Fare < 50:
        return "Medium"
    else:
        return "High"

titanic_clean["FareCategory"] = titanic_clean.apply(fare_category, axis=1)

titanic_clean[["Fare", "FareCategory"]].head()

/var/folders/84/673bjm_x7j1f85ng07w19pjr0000gn/T/ipykernel_20015/3756538058.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic_clean["FareCategory"] = titanic_clean.apply(fare_category, axis=1)

      Fare FareCategory
0   7.2500          Low
1  71.2833         High
2   7.9250          Low
3  53.1000         High
4   8.0500          Low

In [23]:
titanic_clean.groupby("AgeGroup")["Survived"].mean()

AgeGroup
Adult     0.245740
Child     0.396104
Senior    0.175000
Name: Survived, dtype: float64

In [24]:
titanic_clean.sort_values(by="Fare", ascending=False).head(10)

,Age,Fare,Sex,sibsp,Parch,Pclass,Embarked,Survived,AgeGroup,FareCategory
737,35.0,512.3292,0,0,0,1,0.0,1,Adult,High
1234,58.0,512.3292,1,0,1,1,0.0,0,Adult,High
258,35.0,512.3292,1,0,0,1,0.0,1,Adult,High
679,36.0,512.3292,0,0,1,1,0.0,1,Adult,High
438,64.0,263.0000,0,1,4,1,2.0,0,Senior,High
27,19.0,263.0000,0,3,2,1,2.0,0,Adult,High
341,24.0,263.0000,1,3,2,1,2.0,1,Adult,High
944,28.0,263.0000,1,3,2,1,2.0,0,Adult,High
88,23.0,263.0000,1,3,2,1,2.0,1,Adult,High
960,60.0,263.0000,1,1,4,1,2.0,0,Senior,High